In [222]:
# Importing required libraries

import pandas as pd
import numpy as np

In [223]:
# Creating dataset for practicing Pandas

data = {
    "OrderID": [
        1001, 1002, 1003, 1004, 1005,
        1006, 1007, 1008, 1009, 1010,
        1011, 1012, 1013, 1014, 1015,
        1016, 1017, 1018, 1019, 1020
    ],
    
    "Customer": [
        "Alice", "Bob", "Charlie", "Diana", "Emma",
        "Frank", "George", "Helen", "Ian", "Jenny",
        "Kyle", "Laura", "Mike", "Nina", "Oscar",
        "Paul", "Queen", "Rita", "Sam", "Tina"
    ],
    
    # Mixed date formats to test pd.to_datetime parsing
    "OrderDate": [
        "2023-01-05", "05/02/2023", "2023/03/12", "12-04-2023", "2023-05-01",
        "2023-06-15", "15/07/2023", "2023/08/20", "20-09-2023", "2023-10-11",
        "2023-11-01", "01/12/2023", "2024/01/05", "05-02-2024", "2024-03-15",
        "2024-04-18", "18/05/2024", "2024/06/22", "22-07-2024", None
    ],
    
    # Category column for grouping, value_counts, plots
    "Category": [
        "A", "B", "A", "C", "B",
        "A", "C", "B", "C", "A",
        "B", "C", "A", "B", "C",
        "A", "A", "C", "B", "C"
    ],
    
    # Price as string with commas for cleaning exercises
    "UnitPrice": [
        "1,200.50", "500", "750.25", "1,000", "650.00",
        "900", "1,500", "450", "1,050.75", "800",
        "999.99", "1,700", "880.40", "1,250", "600",
        "1,300", "550", "700", "1,450", "1,100"
    ],
    
    # Quantity column for numeric operations
    "Quantity": [
        2, 1, 3, 5, 2,
        4, 1, 2, 3, 5,
        2, 4, 3, 1, 2,
        5, 6, 1, 2, 3
    ],
    
    # Email column for string functions: .str.split, .str.contains, .str.lower, etc.
    "Email": [
        "alice@example.com", "bob@mail.com", "charlie@example.com", "diana@mail.com", "emma@example.com",
        "frank@mail.com", "george@example.com", "helen@mail.com", "ian@mail.com", "jenny@example.com",
        "kyle@mail.com", "laura@example.com", "mike@mail.com", "nina@example.com", "oscar@mail.com",
        "paul@example.com", "queen@mail.com", "rita@example.com", "sam@mail.com", "tina@example.com"
    ],
    
    # Status column for filtering, replace(), category analysis
    "Status": [
        "Delivered", "Pending", "Delivered", "Returned", "Delivered",
        "Pending", "Delivered", "Pending", "Delivered", "Delivered",
        "Returned", "Pending", "Delivered", "Pending", "Delivered",
        "Delivered", "Pending", "Returned", "Pending", "Delivered"
    ],
    
    # Float column with some NaN values for mean(), fillna(), interpolate()
    "Rating": [
        4.5, 3.8, None, 4.2, 5.0,
        None, 3.5, 4.8, 4.0, None,
        3.9, 4.4, None, 5.0, 4.7,
        4.1, None, 3.6, 4.9, 4.3
    ],
    
    # Random sales numbers for sorting, plotting, stats
    "Sales": [
        2400, 500, 2250, 5000, 1300,
        3600, 1500, 900, 3150, 4000,
        1999, 6800, 2641, 1250, 2800,
        3900, 3300, 700, 2900, 2200
    ],
}

### A

In [224]:
df = pd.DataFrame(data)
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
0,1001,Alice,2023-01-05,A,"1,200.50",2,alice@example.com,Delivered,4.5,2400
1,1002,Bob,05/02/2023,B,500,1,bob@mail.com,Pending,3.8,500
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250
3,1004,Diana,12-04-2023,C,"1,000",5,diana@mail.com,Returned,4.2,5000
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300

In [225]:
df.tail()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
15,1016,Paul,2024-04-18,A,"1,300",5,paul@example.com,Delivered,4.1,3900
16,1017,Queen,18/05/2024,A,550,6,queen@mail.com,Pending,NaN,3300
17,1018,Rita,2024/06/22,C,700,1,rita@example.com,Returned,3.6,700
18,1019,Sam,22-07-2024,B,"1,450",2,sam@mail.com,Pending,4.9,2900
19,1020,Tina,None,C,"1,100",3,tina@example.com,Delivered,4.3,2200

In [226]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   OrderID    20 non-null     int64
 1   Customer   20 non-null     object
 2   OrderDate  19 non-null     object
 3   Category   20 non-null     object
 4   UnitPrice  20 non-null     object
 5   Quantity   20 non-null     int64
 6   Email      20 non-null     object
 7   Status     20 non-null     object
 8   Rating     15 non-null     float64
 9   Sales      20 non-null     int64
dtypes: float64(1), int64(3), object(6)
memory usage: 1.7+ KB

In [227]:
df.describe()

          OrderID   Quantity     Rating        Sales
count    20.00000  20.000000  15.000000    20.000000
mean   1010.50000   2.850000   4.313333  2654.500000
std       5.91608   1.531253   0.498378  1542.912096
min    1001.00000   1.000000   3.500000   500.000000
25%    1005.75000   2.000000   3.950000  1450.000000
50%    1010.50000   2.500000   4.300000  2520.500000
75%    1015.25000   4.000000   4.750000  3375.000000
max    1020.00000   6.000000   5.000000  6800.000000

In [228]:
print(df.shape)
print()

print(df.columns)
print()

print(df.index)
print()

print(df.dtypes)
print()

(20, 10)

Index(['OrderID', 'Customer', 'OrderDate', 'Category', 'UnitPrice', 'Quantity',
       'Email', 'Status', 'Rating', 'Sales'],
      dtype='object')

RangeIndex(start=0, stop=20, step=1)

OrderID        int64
Customer      object
OrderDate     object
Category      object
UnitPrice     object
Quantity       int64
Email         object
Status        object
Rating       float64
Sales          int64
dtype: object

In [229]:
print(df['OrderID'])
print()
print(df[['OrderID', 'Sales']])

0     1001
1     1002
2     1003
3     1004
4     1005
5     1006
6     1007
7     1008
8     1009
9     1010
10    1011
11    1012
12    1013
13    1014
14    1015
15    1016
16    1017
17    1018
18    1019
19    1020
Name: OrderID, dtype: int64

    OrderID  Sales
0      1001   2400
1      1002    500
2      1003   2250
3      1004   5000
4      1005   1300
5      1006   3600
6      1007   1500
7      1008    900
8      1009   3150
9      1010   4000
10     1011   1999
11     1012   6800
12     1013   2641
13     1014   1250
14     1015   2800
15     1016   3900
16     1017   3300
17     1018    700
18     1019   2900
19     1020   2200

In [230]:
print(df.iloc[0])

OrderID                   1001
Customer                 Alice
OrderDate           2023-01-05
Category                     A
UnitPrice             1,200.50
Quantity                     2
Email        alice@example.com
Status               Delivered
Rating                     4.5
Sales                     2400
Name: 0, dtype: object

In [231]:
print(df[df['Rating']>4.8])

    OrderID Customer   OrderDate Category UnitPrice  Quantity  \
4      1005     Emma  2023-05-01        B    650.00         2
13     1014     Nina  05-02-2024        B     1,250         1
18     1019      Sam  22-07-2024        B     1,450         2

               Email     Status  Rating  Sales
4   emma@example.com  Delivered     5.0   1300
13  nina@example.com    Pending     5.0   1250
18      sam@mail.com    Pending     4.9   2900

In [232]:
df.columns

Index(['OrderID', 'Customer', 'OrderDate', 'Category', 'UnitPrice', 'Quantity',
       'Email', 'Status', 'Rating', 'Sales'],
      dtype='object')

In [233]:
df['Category'].value_counts()

Category
A    7
C    7
B    6
Name: count, dtype: int64

In [234]:
df[['Category', 'Status']].value_counts()

Category  Status
A         Delivered    5
B         Pending      4
C         Delivered    4
A         Pending      2
C         Returned     2
B         Delivered    1
          Returned     1
C         Pending      1
Name: count, dtype: int64

In [235]:
df['UnitPrice'].sort_values()

3        1,000
8     1,050.75
19       1,100
0     1,200.50
13       1,250
15       1,300
18       1,450
6        1,500
11       1,700
7          450
1          500
16         550
14         600
4       650.00
17         700
2       750.25
9          800
12      880.40
5          900
10      999.99
Name: UnitPrice, dtype: object

In [236]:
df.rename(columns={'Status': 'Status'})

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
0,1001,Alice,2023-01-05,A,"1,200.50",2,alice@example.com,Delivered,4.5,2400
1,1002,Bob,05/02/2023,B,500,1,bob@mail.com,Pending,3.8,500
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250
3,1004,Diana,12-04-2023,C,"1,000",5,diana@mail.com,Returned,4.2,5000
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300
5,1006,Frank,2023-06-15,A,900,4,frank@mail.com,Pending,NaN,3600
6,1007,George,15/07/2023,C,"1,500",1,george@example.com,Delivered,3.5,1500
7,1008,Helen,2023/08/20,B,450,2,helen@mail.com,Pending,4.8,900
8,1009,Ian,20-09-2023,C,"1,050.75",3,ian@mail.com,Delivered,4.0,3150
9,1010,Jenny,2023-10-11,A,800,5,jenny@example.com,Delivered,NaN,4000
10,1011,Kyle,2023-11-01,B,999.99,2,kyle@mail.com,Returned,3.9,1999
11,1012,Laura,01/12/2023,C,"1,700",4,laura@example.com,Pending,4.4,6800
12,1013,Mike,2024/01/05,A,880.40,3,mike@mail.com,Delivered,NaN,2641
13,1014,Nina,05-02-2024,B,"1,250",1,nina@example.com,Pending,5.0,1250
14,1015,Oscar,2024-03-15,C,600,2,oscar@mail.com,Delivered,4.7,2800
15,1016,Paul,2024-04-18,A,"1,300",5,paul@example.com,Delivered,4.1,3900
16,1017,Queen,18/05/2024,A,550,6,queen@mail.com,Pending,NaN,3300
17,1018,Rita,2024/06/22,C,700,1,rita@example.com,Returned,3.6,700
18,1019,Sam,22-07-2024,B,"1,450",2,sam@mail.com,Pending,4.9,2900
19,1020,Tina,None,C,"1,100",3,tina@example.com,Delivered,4.3,2200

====================================================================

### B

In [237]:
df.columns

Index(['OrderID', 'Customer', 'OrderDate', 'Category', 'UnitPrice', 'Quantity',
       'Email', 'Status', 'Rating', 'Sales'],
      dtype='object')

In [238]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
0,1001,Alice,2023-01-05,A,"1,200.50",2,alice@example.com,Delivered,4.5,2400
1,1002,Bob,05/02/2023,B,500,1,bob@mail.com,Pending,3.8,500
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250
3,1004,Diana,12-04-2023,C,"1,000",5,diana@mail.com,Returned,4.2,5000
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300

In [239]:
series1 = pd.Series(df['OrderID'])
print(series1)

0     1001
1     1002
2     1003
3     1004
4     1005
5     1006
6     1007
7     1008
8     1009
9     1010
10    1011
11    1012
12    1013
13    1014
14    1015
15    1016
16    1017
17    1018
18    1019
19    1020
Name: OrderID, dtype: int64

In [240]:
series2 = pd.Series(df['Rating'])
print(series2)

0     4.5
1     3.8
2     NaN
3     4.2
4     5.0
5     NaN
6     3.5
7     4.8
8     4.0
9     NaN
10    3.9
11    4.4
12    NaN
13    5.0
14    4.7
15    4.1
16    NaN
17    3.6
18    4.9
19    4.3
Name: Rating, dtype: float64

In [241]:
series1.cov(series2)

np.float64(0.28952380952380957)

====================================================================

In [242]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
0,1001,Alice,2023-01-05,A,"1,200.50",2,alice@example.com,Delivered,4.5,2400
1,1002,Bob,05/02/2023,B,500,1,bob@mail.com,Pending,3.8,500
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250
3,1004,Diana,12-04-2023,C,"1,000",5,diana@mail.com,Returned,4.2,5000
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300

In [243]:
df['UnitPrice'] = df['UnitPrice'].str.replace(',','').astype(float)

In [244]:
df['IsAbove1K'] = df['UnitPrice'] >= 1000

In [245]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,IsAbove1K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False

In [246]:
df['IsAbove2K'] = df['UnitPrice'] >= 2000

In [247]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,IsAbove1K,IsAbove2K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,False
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,False
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,False

In [248]:
df.drop(columns=['IsAbove2K'], inplace=True)

In [249]:
df.rename(columns={'IsAbove1K':'Above1K'}, inplace=True)

In [250]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False

In [251]:
df.drop(index=19)

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False
5,1006,Frank,2023-06-15,A,900.00,4,frank@mail.com,Pending,NaN,3600,False
6,1007,George,15/07/2023,C,1500.00,1,george@example.com,Delivered,3.5,1500,True
7,1008,Helen,2023/08/20,B,450.00,2,helen@mail.com,Pending,4.8,900,False
8,1009,Ian,20-09-2023,C,1050.75,3,ian@mail.com,Delivered,4.0,3150,True
9,1010,Jenny,2023-10-11,A,800.00,5,jenny@example.com,Delivered,NaN,4000,False
10,1011,Kyle,2023-11-01,B,999.99,2,kyle@mail.com,Returned,3.9,1999,False
11,1012,Laura,01/12/2023,C,1700.00,4,laura@example.com,Pending,4.4,6800,True
12,1013,Mike,2024/01/05,A,880.40,3,mike@mail.com,Delivered,NaN,2641,False
13,1014,Nina,05-02-2024,B,1250.00,1,nina@example.com,Pending,5.0,1250,True
14,1015,Oscar,2024-03-15,C,600.00,2,oscar@mail.com,Delivered,4.7,2800,False
15,1016,Paul,2024-04-18,A,1300.00,5,paul@example.com,Delivered,4.1,3900,True
16,1017,Queen,18/05/2024,A,550.00,6,queen@mail.com,Pending,NaN,3300,False
17,1018,Rita,2024/06/22,C,700.00,1,rita@example.com,Returned,3.6,700,False
18,1019,Sam,22-07-2024,B,1450.00,2,sam@mail.com,Pending,4.9,2900,True

In [252]:
df.set_index('OrderID')

,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K
OrderID,,,,,,,,,,
1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False
1006,Frank,2023-06-15,A,900.00,4,frank@mail.com,Pending,NaN,3600,False
1007,George,15/07/2023,C,1500.00,1,george@example.com,Delivered,3.5,1500,True
1008,Helen,2023/08/20,B,450.00,2,helen@mail.com,Pending,4.8,900,False
1009,Ian,20-09-2023,C,1050.75,3,ian@mail.com,Delivered,4.0,3150,True
1010,Jenny,2023-10-11,A,800.00,5,jenny@example.com,Delivered,NaN,4000,False
1011,Kyle,2023-11-01,B,999.99,2,kyle@mail.com,Returned,3.9,1999,False
1012,Laura,01/12/2023,C,1700.00,4,laura@example.com,Pending,4.4,6800,True
1013,Mike,2024/01/05,A,880.40,3,mike@mail.com,Delivered,NaN,2641,False
1014,Nina,05-02-2024,B,1250.00,1,nina@example.com,Pending,5.0,1250,True
1015,Oscar,2024-03-15,C,600.00,2,oscar@mail.com,Delivered,4.7,2800,False
1016,Paul,2024-04-18,A,1300.00,5,paul@example.com,Delivered,4.1,3900,True
1017,Queen,18/05/2024,A,550.00,6,queen@mail.com,Pending,NaN,3300,False
1018,Rita,2024/06/22,C,700.00,1,rita@example.com,Returned,3.6,700,False
1019,Sam,22-07-2024,B,1450.00,2,sam@mail.com,Pending,4.9,2900,True
1020,Tina,None,C,1100.00,3,tina@example.com,Delivered,4.3,2200,True

In [253]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False

In [254]:
df.loc[2:5,['OrderID', 'UnitPrice']]

   OrderID  UnitPrice
2     1003     750.25
3     1004    1000.00
4     1005     650.00
5     1006     900.00

In [255]:
df.loc[2:5,'OrderID': 'UnitPrice']

   OrderID Customer   OrderDate Category  UnitPrice
2     1003  Charlie  2023/03/12        A     750.25
3     1004    Diana  12-04-2023        C    1000.00
4     1005     Emma  2023-05-01        B     650.00
5     1006    Frank  2023-06-15        A     900.00

In [256]:
df.iloc[2:5, 0:2]

   OrderID Customer
2     1003  Charlie
3     1004    Diana
4     1005     Emma

In [257]:
df.iloc[0]

OrderID                   1001
Customer                 Alice
OrderDate           2023-01-05
Category                     A
UnitPrice               1200.5
Quantity                     2
Email        alice@example.com
Status               Delivered
Rating                     4.5
Sales                     2400
Above1K                   True
Name: 0, dtype: object

In [258]:
series3 = pd.Series(df['Customer'])
series3.head()

0      Alice
1        Bob
2    Charlie
3      Diana
4       Emma
Name: Customer, dtype: object

In [259]:
print(series3.str.upper())

0       ALICE
1         BOB
2     CHARLIE
3       DIANA
4        EMMA
5       FRANK
6      GEORGE
7       HELEN
8         IAN
9       JENNY
10       KYLE
11      LAURA
12       MIKE
13       NINA
14      OSCAR
15       PAUL
16      QUEEN
17       RITA
18        SAM
19       TINA
Name: Customer, dtype: object

In [260]:
print(series3.str.slice(2,5))

0     ice
1       b
2     arl
3     ana
4      ma
5     ank
6     org
7     len
8       n
9     nny
10     le
11    ura
12     ke
13     na
14    car
15     ul
16    een
17     ta
18      m
19     na
Name: Customer, dtype: object

In [261]:
print(series3.str.replace('A','Z',regex=True))

0       Zlice
1         Bob
2     Charlie
3       Diana
4        Emma
5       Frank
6      George
7       Helen
8         Ian
9       Jenny
10       Kyle
11      Laura
12       Mike
13       Nina
14      Oscar
15       Paul
16      Queen
17       Rita
18        Sam
19       Tina
Name: Customer, dtype: object

In [262]:
print(series3.str.replace('A|B','Z', regex=True))

0       Zlice
1         Zob
2     Charlie
3       Diana
4        Emma
5       Frank
6      George
7       Helen
8         Ian
9       Jenny
10       Kyle
11      Laura
12       Mike
13       Nina
14      Oscar
15       Paul
16      Queen
17       Rita
18        Sam
19       Tina
Name: Customer, dtype: object

In [263]:
series3.replace({'A': 'Z', 'B': 'Y', 'C': 'X'}, regex=True)

0       Zlice
1         Yob
2     Xharlie
3       Diana
4        Emma
5       Frank
6      George
7       Helen
8         Ian
9       Jenny
10       Kyle
11      Laura
12       Mike
13       Nina
14      Oscar
15       Paul
16      Queen
17       Rita
18        Sam
19       Tina
Name: Customer, dtype: object

In [264]:
print(df['Customer'].str.replace("A|B","Z", regex=True))

0       Zlice
1         Zob
2     Charlie
3       Diana
4        Emma
5       Frank
6      George
7       Helen
8         Ian
9       Jenny
10       Kyle
11      Laura
12       Mike
13       Nina
14      Oscar
15       Paul
16      Queen
17       Rita
18        Sam
19       Tina
Name: Customer, dtype: object

====================================================================

### C

In [265]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False

In [266]:
def TotalCost(row):
    return row['UnitPrice'] * row['Quantity']

In [267]:
df['TotalCost'] = df.apply(TotalCost, axis = 1)

df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K,TotalCost
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,2401.00
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,500.00
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,2250.75
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,5000.00
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,1300.00

In [268]:
df['SqureRootCost'] = df['TotalCost'].apply(np.sqrt)

In [269]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K,TotalCost,SqureRootCost
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,2401.00,49.000000
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,500.00,22.360680
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,2250.75,47.442070
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,5000.00,70.710678
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,1300.00,36.055513

In [270]:
df['TotalCost'].values

array([2401.  ,  500.  , 2250.75, 5000.  , 1300.  , 3600.  , 1500.  ,
        900.  , 3152.25, 4000.  , 1999.98, 6800.  , 2641.2 , 1250.  ,
       1200.  , 6500.  , 3300.  ,  700.  , 2900.  , 3300.  ])

In [271]:
print(np.sum(df['TotalCost'].values))

55195.18

In [272]:
df.agg({'TotalCost':['mean', 'min', 'max']})

      TotalCost
mean   2759.759
min     500.000
max    6800.000

In [273]:
df[['TotalCost', 'SqureRootCost']].agg(['mean','min','max'])

      TotalCost  SqureRootCost
mean   2759.759      49.904222
min     500.000      22.360680
max    6800.000      82.462113

In [274]:
df.rename(columns={'SqureRootCost':'SquareRootCost'}, inplace=True)

In [275]:
df.head(20)

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K,TotalCost,SquareRootCost
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,2401.00,49.000000
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,500.00,22.360680
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,2250.75,47.442070
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,5000.00,70.710678
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,1300.00,36.055513
5,1006,Frank,2023-06-15,A,900.00,4,frank@mail.com,Pending,NaN,3600,False,3600.00,60.000000
6,1007,George,15/07/2023,C,1500.00,1,george@example.com,Delivered,3.5,1500,True,1500.00,38.729833
7,1008,Helen,2023/08/20,B,450.00,2,helen@mail.com,Pending,4.8,900,False,900.00,30.000000
8,1009,Ian,20-09-2023,C,1050.75,3,ian@mail.com,Delivered,4.0,3150,True,3152.25,56.144902
9,1010,Jenny,2023-10-11,A,800.00,5,jenny@example.com,Delivered,NaN,4000,False,4000.00,63.245553
10,1011,Kyle,2023-11-01,B,999.99,2,kyle@mail.com,Returned,3.9,1999,False,1999.98,44.721136
11,1012,Laura,01/12/2023,C,1700.00,4,laura@example.com,Pending,4.4,6800,True,6800.00,82.462113
12,1013,Mike,2024/01/05,A,880.40,3,mike@mail.com,Delivered,NaN,2641,False,2641.20,51.392606
13,1014,Nina,05-02-2024,B,1250.00,1,nina@example.com,Pending,5.0,1250,True,1250.00,35.355339
14,1015,Oscar,2024-03-15,C,600.00,2,oscar@mail.com,Delivered,4.7,2800,False,1200.00,34.641016
15,1016,Paul,2024-04-18,A,1300.00,5,paul@example.com,Delivered,4.1,3900,True,6500.00,80.622577
16,1017,Queen,18/05/2024,A,550.00,6,queen@mail.com,Pending,NaN,3300,False,3300.00,57.445626
17,1018,Rita,2024/06/22,C,700.00,1,rita@example.com,Returned,3.6,700,False,700.00,26.457513
18,1019,Sam,22-07-2024,B,1450.00,2,sam@mail.com,Pending,4.9,2900,True,2900.00,53.851648
19,1020,Tina,None,C,1100.00,3,tina@example.com,Delivered,4.3,2200,True,3300.00,57.445626

In [276]:
index = pd.date_range('2025-11-20 12:01', periods=20, freq='Y')

C:\Users\himan\AppData\Local\Temp\ipykernel_21224\1501635739.py:1: FutureWarning: 'Y' is deprecated and will be removed in a future version, please use 'YE' instead.
  index = pd.date_range('2025-11-20 12:01', periods=20, freq='Y')

In [277]:
series3.head()

0      Alice
1        Bob
2    Charlie
3      Diana
4       Emma
Name: Customer, dtype: object

In [278]:
series3.index = index
series3.head()

2025-12-31 12:01:00      Alice
2026-12-31 12:01:00        Bob
2027-12-31 12:01:00    Charlie
2028-12-31 12:01:00      Diana
2029-12-31 12:01:00       Emma
Freq: YE-DEC, Name: Customer, dtype: object

In [279]:
series2.head()

0    4.5
1    3.8
2    NaN
3    4.2
4    5.0
Name: Rating, dtype: float64

In [280]:
series2.mean()

np.float64(4.3133333333333335)

In [281]:
df['TotalCost'].sem()

np.float64(399.17783698029024)

In [282]:
df['Rating'].value_counts()

Rating
5.0    2
4.5    1
3.8    1
4.2    1
3.5    1
4.8    1
4.0    1
3.9    1
4.4    1
4.7    1
4.1    1
3.6    1
4.9    1
4.3    1
Name: count, dtype: int64

====================================================================

In [283]:
df['Rating2XError'] = df.apply(lambda r: 2*r['Rating'], axis=1)

In [284]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K,TotalCost,SquareRootCost,Rating2XError
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,2401.00,49.000000,9.0
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,500.00,22.360680,7.6
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,2250.75,47.442070,NaN
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,5000.00,70.710678,8.4
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,1300.00,36.055513,10.0

In [285]:
df['Rating2X'] = df.apply(lambda r: (2*(r['Rating'] if pd.notna(r['Rating']) else 0)), axis=1)

In [286]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K,TotalCost,SquareRootCost,Rating2XError,Rating2X
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,2401.00,49.000000,9.0,9.0
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,500.00,22.360680,7.6,7.6
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,2250.75,47.442070,NaN,0.0
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,5000.00,70.710678,8.4,8.4
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,1300.00,36.055513,10.0,10.0

In [287]:
df= df.assign(Rating2XUsingAssign = lambda x: 2*x['Rating'])

In [288]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K,TotalCost,SquareRootCost,Rating2XError,Rating2X,Rating2XUsingAssign
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,2401.00,49.000000,9.0,9.0,9.0
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,500.00,22.360680,7.6,7.6,7.6
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,2250.75,47.442070,NaN,0.0,NaN
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,5000.00,70.710678,8.4,8.4,8.4
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,1300.00,36.055513,10.0,10.0,10.0

### D

In [289]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K,TotalCost,SquareRootCost,Rating2XError,Rating2X,Rating2XUsingAssign
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,2401.00,49.000000,9.0,9.0,9.0
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,500.00,22.360680,7.6,7.6,7.6
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,2250.75,47.442070,NaN,0.0,NaN
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,5000.00,70.710678,8.4,8.4,8.4
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,1300.00,36.055513,10.0,10.0,10.0

In [290]:
trunc = df.truncate(before=1, after=2)

In [291]:
trunc.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K,TotalCost,SquareRootCost,Rating2XError,Rating2X,Rating2XUsingAssign
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,500.00,22.36068,7.6,7.6,7.6
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,2250.75,47.44207,NaN,0.0,NaN

In [292]:
for i,r in df.iterrows():
    print(i,r['Customer'])

0 Alice
1 Bob
2 Charlie
3 Diana
4 Emma
5 Frank
6 George
7 Helen
8 Ian
9 Jenny
10 Kyle
11 Laura
12 Mike
13 Nina
14 Oscar
15 Paul
16 Queen
17 Rita
18 Sam
19 Tina

In [293]:
for c in df.columns:
    print(c)

OrderID
Customer
OrderDate
Category
UnitPrice
Quantity
Email
Status
Rating
Sales
Above1K
TotalCost
SquareRootCost
Rating2XError
Rating2X
Rating2XUsingAssign

In [294]:
print(df.sort_values(by="Rating"))

    OrderID Customer   OrderDate Category  UnitPrice  Quantity  \
6      1007   George  15/07/2023        C    1500.00         1
17     1018     Rita  2024/06/22        C     700.00         1
1      1002      Bob  05/02/2023        B     500.00         1
10     1011     Kyle  2023-11-01        B     999.99         2
8      1009      Ian  20-09-2023        C    1050.75         3
15     1016     Paul  2024-04-18        A    1300.00         5
3      1004    Diana  12-04-2023        C    1000.00         5
19     1020     Tina        None        C    1100.00         3
11     1012    Laura  01/12/2023        C    1700.00         4
0      1001    Alice  2023-01-05        A    1200.50         2
14     1015    Oscar  2024-03-15        C     600.00         2
7      1008    Helen  2023/08/20        B     450.00         2
18     1019      Sam  22-07-2024        B    1450.00         2
4      1005     Emma  2023-05-01        B     650.00         2
13     1014     Nina  05-02-2024        B    1250.00         1
2      1003  Charlie  2023/03/12        A     750.25         3
5      1006    Frank  2023-06-15        A     900.00         4
9      1010    Jenny  2023-10-11        A     800.00         5
12     1013     Mike  2024/01/05        A     880.40         3
16     1017    Queen  18/05/2024        A     550.00         6

                  Email     Status  Rating  Sales  Above1K  TotalCost  \
6    george@example.com  Delivered     3.5   1500     True    1500.00
17     rita@example.com   Returned     3.6    700    False     700.00
1          bob@mail.com    Pending     3.8    500    False     500.00
10        kyle@mail.com   Returned     3.9   1999    False    1999.98
8          ian@mail.com  Delivered     4.0   3150     True    3152.25
15     paul@example.com  Delivered     4.1   3900     True    6500.00
3        diana@mail.com   Returned     4.2   5000     True    5000.00
19     tina@example.com  Delivered     4.3   2200     True    3300.00
11    laura@example.com    Pending     4.4   6800     True    6800.00
0     alice@example.com  Delivered     4.5   2400     True    2401.00
14       oscar@mail.com  Delivered     4.7   2800    False    1200.00
7        helen@mail.com    Pending     4.8    900    False     900.00
18         sam@mail.com    Pending     4.9   2900     True    2900.00
4      emma@example.com  Delivered     5.0   1300    False    1300.00
13     nina@example.com    Pending     5.0   1250     True    1250.00
2   charlie@example.com  Delivered     NaN   2250    False    2250.75
5        frank@mail.com    Pending     NaN   3600    False    3600.00
9     jenny@example.com  Delivered     NaN   4000    False    4000.00
12        mike@mail.com  Delivered     NaN   2641    False    2641.20
16       queen@mail.com    Pending     NaN   3300    False    3300.00

    SquareRootCost  Rating2XError  Rating2X  Rating2XUsingAssign
6        38.729833            7.0       7.0                  7.0
17       26.457513            7.2       7.2                  7.2
1        22.360680            7.6       7.6                  7.6
10       44.721136            7.8       7.8                  7.8
8        56.144902            8.0       8.0                  8.0
15       80.622577            8.2       8.2                  8.2
3        70.710678            8.4       8.4                  8.4
19       57.445626            8.6       8.6                  8.6
11       82.462113            8.8       8.8                  8.8
0        49.000000            9.0       9.0                  9.0
14       34.641016            9.4       9.4                  9.4
7        30.000000            9.6       9.6                  9.6
18       53.851648            9.8       9.8                  9.8
4        36.055513           10.0      10.0                 10.0
13       35.355339           10.0      10.0                 10.0
2        47.442070            NaN       0.0                  NaN
5        60.000000            NaN       0.0                  NaN
9        63.245553            NaN       0.0                  NaN
12       51.392606            NaN       0.0                  NaN
16       57.445626            NaN       0.0                  NaN

In [295]:
print(df.sort_values(by="Rating", ascending=False))

    OrderID Customer   OrderDate Category  UnitPrice  Quantity  \
4      1005     Emma  2023-05-01        B     650.00         2
13     1014     Nina  05-02-2024        B    1250.00         1
18     1019      Sam  22-07-2024        B    1450.00         2
7      1008    Helen  2023/08/20        B     450.00         2
14     1015    Oscar  2024-03-15        C     600.00         2
0      1001    Alice  2023-01-05        A    1200.50         2
11     1012    Laura  01/12/2023        C    1700.00         4
19     1020     Tina        None        C    1100.00         3
3      1004    Diana  12-04-2023        C    1000.00         5
15     1016     Paul  2024-04-18        A    1300.00         5
8      1009      Ian  20-09-2023        C    1050.75         3
10     1011     Kyle  2023-11-01        B     999.99         2
1      1002      Bob  05/02/2023        B     500.00         1
17     1018     Rita  2024/06/22        C     700.00         1
6      1007   George  15/07/2023        C    1500.00         1
2      1003  Charlie  2023/03/12        A     750.25         3
5      1006    Frank  2023-06-15        A     900.00         4
9      1010    Jenny  2023-10-11        A     800.00         5
12     1013     Mike  2024/01/05        A     880.40         3
16     1017    Queen  18/05/2024        A     550.00         6

                  Email     Status  Rating  Sales  Above1K  TotalCost  \
4      emma@example.com  Delivered     5.0   1300    False    1300.00
13     nina@example.com    Pending     5.0   1250     True    1250.00
18         sam@mail.com    Pending     4.9   2900     True    2900.00
7        helen@mail.com    Pending     4.8    900    False     900.00
14       oscar@mail.com  Delivered     4.7   2800    False    1200.00
0     alice@example.com  Delivered     4.5   2400     True    2401.00
11    laura@example.com    Pending     4.4   6800     True    6800.00
19     tina@example.com  Delivered     4.3   2200     True    3300.00
3        diana@mail.com   Returned     4.2   5000     True    5000.00
15     paul@example.com  Delivered     4.1   3900     True    6500.00
8          ian@mail.com  Delivered     4.0   3150     True    3152.25
10        kyle@mail.com   Returned     3.9   1999    False    1999.98
1          bob@mail.com    Pending     3.8    500    False     500.00
17     rita@example.com   Returned     3.6    700    False     700.00
6    george@example.com  Delivered     3.5   1500     True    1500.00
2   charlie@example.com  Delivered     NaN   2250    False    2250.75
5        frank@mail.com    Pending     NaN   3600    False    3600.00
9     jenny@example.com  Delivered     NaN   4000    False    4000.00
12        mike@mail.com  Delivered     NaN   2641    False    2641.20
16       queen@mail.com    Pending     NaN   3300    False    3300.00

    SquareRootCost  Rating2XError  Rating2X  Rating2XUsingAssign
4        36.055513           10.0      10.0                 10.0
13       35.355339           10.0      10.0                 10.0
18       53.851648            9.8       9.8                  9.8
7        30.000000            9.6       9.6                  9.6
14       34.641016            9.4       9.4                  9.4
0        49.000000            9.0       9.0                  9.0
11       82.462113            8.8       8.8                  8.8
19       57.445626            8.6       8.6                  8.6
3        70.710678            8.4       8.4                  8.4
15       80.622577            8.2       8.2                  8.2
8        56.144902            8.0       8.0                  8.0
10       44.721136            7.8       7.8                  7.8
1        22.360680            7.6       7.6                  7.6
17       26.457513            7.2       7.2                  7.2
6        38.729833            7.0       7.0                  7.0
2        47.442070            NaN       0.0                  NaN
5        60.000000            NaN       0.0                  NaN
9        63.245553            NaN       0.0                  NaN
12       51.392606            NaN       0.0                  NaN
16       57.445626            NaN       0.0                  NaN

In [296]:
g = df.groupby('Rating')

In [297]:
print(g.size())

Rating
3.5    1
3.6    1
3.8    1
3.9    1
4.0    1
4.1    1
4.2    1
4.3    1
4.4    1
4.5    1
4.7    1
4.8    1
4.9    1
5.0    2
dtype: int64

In [298]:
print(g['OrderID'].sum())

Rating
3.5    1007
3.6    1018
3.8    1002
3.9    1011
4.0    1009
4.1    1016
4.2    1004
4.3    1020
4.4    1012
4.5    1001
4.7    1015
4.8    1008
4.9    1019
5.0    2019
Name: OrderID, dtype: int64

In [299]:
agg_result = df.groupby('Above1K').agg({
    'OrderID': ['mean','sum','max'],     # for Salary compute mean, sum, max
    'Sales': 'mean'                      # for Age just mean
})

In [300]:
print(agg_result)

             OrderID                     Sales
                mean    sum   max         mean
Above1K
False    1009.818182  11108  1018  2180.909091
True     1011.333333   9102  1020  3233.333333

==========================================================================

In [301]:
left = pd.DataFrame({
    'key': ['K0','K1','K2','K3'],
    'A'  : ['A0','A1','A2','A3'],
    'B'  : ['B0','B1','B2','B3']
})

right = pd.DataFrame({
    'key': ['K0','K1','K2','K4'],
    'C'  : ['C0','C1','C2','C4'],
    'D'  : ['D0','D1','D2','D4']
})

In [302]:
left.head()

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [303]:
right.head()

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K4  C4  D4

In [304]:
inner = pd.merge(left,right, on='key', how='inner')

In [305]:
print(inner)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [306]:
LJ = pd.merge(left,right, on='key', how='left')
RJ = pd.merge(left,right, on='key', how='right')

In [307]:
print(LJ)
print()
print(RJ)

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3  NaN  NaN

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K4  NaN  NaN  C4  D4

In [308]:
# Merge on different key names example
L2 = left.rename(columns={'key':'lkey'})
R2 = right.rename(columns={'key':'rkey'})

In [309]:
diff = pd.merge(L2, R2, left_on='lkey', right_on='rkey', how='inner')

In [310]:
print(diff)

  lkey   A   B rkey   C   D
0   K0  A0  B0   K0  C0  D0
1   K1  A1  B1   K1  C1  D1
2   K2  A2  B2   K2  C2  D2

In [311]:
left_idx = left.set_index('key')
right_idx = right.set_index('key')

In [312]:
joined = left_idx.join(right_idx, how='left')
print(joined, "\n")

      A   B    C    D
key
K0   A0  B0   C0   D0
K1   A1  B1   C1   D1
K2   A2  B2   C2   D2
K3   A3  B3  NaN  NaN

==========================================================================

In [313]:
con = pd.concat([left,right],axis=0,ignore_index=True)
print(con)

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
4  K0  NaN  NaN   C0   D0
5  K1  NaN  NaN   C1   D1
6  K2  NaN  NaN   C2   D2
7  K4  NaN  NaN   C4   D4

In [314]:
con2 = pd.concat([ left,right],axis=1,ignore_index=False)
print(con2)
print()
con2 = pd.concat([ left,right],axis=1,ignore_index=True)
print(con2)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K4  C4  D4

    0   1   2   3   4   5
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K4  C4  D4

In [315]:
s_first = pd.Series(['John','Jane','Mary'])
s_last  = pd.Series(['Doe','Roe', None])

print("First:\n", s_first)
print("Last:\n", s_last)

# Concatenate first + ' ' + last; fill missing last name with empty string using na_rep
full = s_first.str.cat(s_last, sep=' ', na_rep='')
print(full.tolist())

First:
 0    John
1    Jane
2    Mary
dtype: object
Last:
 0     Doe
1     Roe
2    None
dtype: object
['John Doe', 'Jane Roe', 'Mary ']

In [316]:
s_lists = pd.Series([['a','b'], ['x','y','z'], []])
joined_within = s_lists.str.join('-')   # joins list elements with '-'
print(joined_within.tolist(), "\n")

['a-b', 'x-y-z', '']

In [317]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]})
df2 = pd.DataFrame({'A':[1,20,3], 'B':[4,50,6]})

print("df1:\n", df1, "\n")
print("df2:\n", df2, "\n")

df1:
    A  B
0  1  4
1  2  5
2  3  6

df2:
     A   B
0   1   4
1  20  50
2   3   6

In [318]:
cmp = df1.compare(df2) 
print( cmp, "\n")

     A          B
  self other self other
1  2.0  20.0  5.0  50.0

In [319]:
s1 = pd.Series([1,2,3])
s2 = pd.Series([1,20,3])
print("s1.compare(s2):\n", s1.compare(s2), "\n")

s1.compare(s2):
    self  other
1   2.0   20.0

In [320]:
sa = pd.Series([10, 20, np.nan, 40], index=['a','b','c','d'])
sb = pd.Series([10, 21, 30, 41], index=['a','b','c','d'])
print("sa:\n", sa)
print("sb:\n", sb, "\n")

sa:
 a    10.0
b    20.0
c     NaN
d    40.0
dtype: float64
sb:
 a    10
b    21
c    30
d    41
dtype: int64

In [321]:
# Elementwise difference (NaNs propagate)
print("Difference sa - sb:\n", sa - sb, "\n")

# Elementwise boolean equality (treat NaNs as not equal)
print("sa == sb ->\n", sa == sb, "\n")

Difference sa - sb:
 a    0.0
b   -1.0
c    NaN
d   -1.0
dtype: float64

sa == sb ->
 a     True
b    False
c    False
d    False
dtype: bool

In [322]:
def compare_vals(x, y):
    if pd.isna(x) and pd.isna(y):
        return np.nan
    if x == y:
        return x
    return (x, y)

comp_series = sa.combine(sb, compare_vals)
print("sa.combine(sb, compare_vals) ->\n", comp_series, "\n")

sa.combine(sb, compare_vals) ->
 a          10.0
b    (20.0, 21)
c     (nan, 30)
d    (40.0, 41)
dtype: object

==========================================================================

### E

In [323]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K,TotalCost,SquareRootCost,Rating2XError,Rating2X,Rating2XUsingAssign
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,2401.00,49.000000,9.0,9.0,9.0
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,500.00,22.360680,7.6,7.6,7.6
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,2250.75,47.442070,NaN,0.0,NaN
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,5000.00,70.710678,8.4,8.4,8.4
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,1300.00,36.055513,10.0,10.0,10.0

In [324]:
print(pd.Timestamp.now())

2025-11-20 16:21:37.887308

In [325]:
print(pd.Timestamp.now().isoformat())

2025-11-20T16:21:37.905780

In [326]:
print(pd.Timestamp.now().date())

2025-11-20

In [327]:
print(pd.Timestamp.now().time())

16:21:37.932881

In [328]:
print(pd.Timestamp.now().timestamp())

1763655697.943864

In [329]:
print(df['OrderDate'])

0     2023-01-05
1     05/02/2023
2     2023/03/12
3     12-04-2023
4     2023-05-01
5     2023-06-15
6     15/07/2023
7     2023/08/20
8     20-09-2023
9     2023-10-11
10    2023-11-01
11    01/12/2023
12    2024/01/05
13    05-02-2024
14    2024-03-15
15    2024-04-18
16    18/05/2024
17    2024/06/22
18    22-07-2024
19          None
Name: OrderDate, dtype: object

In [330]:
pd.to_datetime(df['OrderDate'],errors='coerce')

0    2023-01-05
1           NaT
2           NaT
3           NaT
4    2023-05-01
5    2023-06-15
6           NaT
7           NaT
8           NaT
9    2023-10-11
10   2023-11-01
11          NaT
12          NaT
13          NaT
14   2024-03-15
15   2024-04-18
16          NaT
17          NaT
18          NaT
19          NaT
Name: OrderDate, dtype: datetime64[ns]

In [340]:
def parse_date(x):
    for fmt in ("%Y-%m-%d", "%d/%m/%Y", "%Y/%m/%d", "%d-%m-%Y"):
        try:
            return pd.to_datetime(x, format=fmt)
        except:
            pass
    return pd.NaT

converted = df['OrderDate'].apply(parse_date)

print(converted)

0    2023-01-05
1    2023-02-05
2    2023-03-12
3    2023-04-12
4    2023-05-01
5    2023-06-15
6    2023-07-15
7    2023-08-20
8    2023-09-20
9    2023-10-11
10   2023-11-01
11   2023-12-01
12   2024-01-05
13   2024-02-05
14   2024-03-15
15   2024-04-18
16   2024-05-18
17   2024-06-22
18   2024-07-22
19          NaT
Name: OrderDate, dtype: datetime64[ns]

In [341]:
df['OrderDate'] = converted

==========================================================================

In [342]:
utc_now = pd.Timestamp.now(tz='UTC')   # timezone specified by string
print("UTC now:", utc_now)

UTC now: 2025-11-20 10:53:12.862296+00:00

In [343]:
india = utc_now.tz_convert('Asia/Kolkata')   # convert tz-aware ts to Asia/Kolkata
print("UTC -> Asia/Kolkata:", india)

UTC -> Asia/Kolkata: 2025-11-20 16:23:12.862296+05:30

In [344]:
base = pd.Timestamp("2021-01-15")
print("base:", base)

base: 2021-01-15 00:00:00

In [345]:
one_month_later = base + pd.offsets.DateOffset(months=1)  # result: 2021-02-15
print("base + DateOffset(months=1):", one_month_later)

base + DateOffset(months=1): 2021-02-15 00:00:00

In [346]:
bd_plus1 = base + pd.offsets.Day(1)
print("base + Day(1):", bd_plus1)

base + Day(1): 2021-01-16 00:00:00

In [347]:
bd_plus1 = base + pd.offsets.BusinessDay(1)
print("base + BusinessDay(1):", bd_plus1)

base + BusinessDay(1): 2021-01-18 00:00:00

In [348]:
s_time = pd.Series(pd.to_datetime(["2021-01-02", "2022-05-06", "2020-12-31"]))
print("s_time:\n", s_time)

s_time:
 0   2021-01-02
1   2022-05-06
2   2020-12-31
dtype: datetime64[ns]

In [349]:
print("Year:", s_time.dt.year.tolist())
print("Month:", s_time.dt.month.tolist())
print("Day:", s_time.dt.day.tolist())
print("Day of week (0=Mon):", s_time.dt.dayofweek.tolist())
print("Is month end?:", s_time.dt.is_month_end.tolist())
print("Day name:", s_time.dt.day_name().tolist())

Year: [2021, 2022, 2020]
Month: [1, 5, 12]
Day: [2, 6, 31]
Day of week (0=Mon): [5, 4, 3]
Is month end?: [False, False, True]
Day name: ['Saturday', 'Friday', 'Thursday']

==========================================================================

In [350]:
s_text = pd.Series([
    "  Hello World  ",
    "Pandas is Great",
    "foo,bar,baz",
    None,          # missing value example (NaN-like)
    "  mixed CASE "
])

In [351]:
print(s_text.tolist())

['  Hello World  ', 'Pandas is Great', 'foo,bar,baz', None, '  mixed CASE ']

In [352]:
print("\nstr.lower ->", s_text.str.lower().tolist())
print("str.upper ->", s_text.str.upper().tolist())
print("str.title ->", s_text.str.title().tolist())

str.lower -> ['  hello world  ', 'pandas is great', 'foo,bar,baz', None, '  mixed case ']
str.upper -> ['  HELLO WORLD  ', 'PANDAS IS GREAT', 'FOO,BAR,BAZ', None, '  MIXED CASE ']
str.title -> ['  Hello World  ', 'Pandas Is Great', 'Foo,Bar,Baz', None, '  Mixed Case ']

In [353]:
print("\nstr.strip ->", s_text.str.strip().tolist())     # removes leading/trailing spaces
print("str.lstrip ->", s_text.str.lstrip().tolist())     # remove left only
print("str.rstrip ->", s_text.str.rstrip().tolist())     # remove right only

str.strip -> ['Hello World', 'Pandas is Great', 'foo,bar,baz', None, 'mixed CASE']
str.lstrip -> ['Hello World  ', 'Pandas is Great', 'foo,bar,baz', None, 'mixed CASE ']
str.rstrip -> ['  Hello World', 'Pandas is Great', 'foo,bar,baz', None, '  mixed CASE']

In [357]:
print(s_text.str.replace(',', '|', regex=True).tolist())

['  Hello World  ', 'Pandas is Great', 'foo|bar|baz', None, '  mixed CASE ']

In [358]:
print( s_text.str.replace(r'\s+', ' ', regex=True).tolist())

[' Hello World ', 'Pandas is Great', 'foo,bar,baz', None, ' mixed CASE ']

In [359]:
s_vals = pd.Series([1, 2, 3, np.nan, 2])
print("s_vals:", s_vals.tolist())

s_vals: [1.0, 2.0, 3.0, nan, 2.0]

In [362]:
print(s_vals.replace(2, 200).tolist())

[1.0, 200.0, 3.0, nan, 200.0]

In [363]:
print(s_vals.replace({1:10, 2:20}).tolist())

[10.0, 20.0, 3.0, nan, 20.0]

==========================================================================

### F

In [364]:
import pandas as pd
import numpy as np
import os

In [365]:
# ============================================================
# 1) pd.read_csv: common usage & parameters
# ============================================================
#
# pd.read_csv(filepath_or_buffer, sep=',', header='infer', index_col=None,
#             usecols=None, dtype=None, parse_dates=False, dayfirst=False,
#             thousands=None, na_values=None, skiprows=None, nrows=None)
#
# Important parameters:
#  - sep: delimiter (',' default). Use '\t' for TSV.
#  - header: row number(s) to use as column names (0-based). None if no header.
#  - index_col: column(s) to use as index.
#  - usecols: subset of columns to read (list or callable).
#  - dtype: dict to force types for columns.
#  - parse_dates: column name(s) to parse as datetimes (True/list/dict).
#  - thousands: character used as thousands separator (e.g., ',').
#  - na_values: additional strings to recognize as NA.
#  - skiprows, nrows: read subset of file.
#
# We'll create a CSV first to demonstrate reading options.

In [ ]:
# ============================================================
# 2) DataFrame.to_csv: options when writing CSV
# ============================================================
#
# df.to_csv(path_or_buf, sep=',', na_rep='', float_format=None, columns=None,
#           header=True, index=True, index_label=None)
#
# Useful params:
#  - na_rep: string to represent missing values
#  - float_format: format string for floats e.g. '%.2f'
#  - columns: subset and order of columns to write
#  - index: whether to write row index
#  - index_label: label for index column when written

In [ ]:
# ============================================================
# 3) pd.read_excel: reading Excel files
# ============================================================
#
# pd.read_excel(io, sheet_name=0, header=0, names=None, index_col=None,
#               usecols=None, skiprows=None, nrows=None, dtype=None, parse_dates=False)
#
# Important parameters:
#  - sheet_name: sheet name (str) or index (0-based) or list/None('all' to read all)
#  - usecols: e.g., "A:C" or [0,2] or list of names
#  - skiprows: rows to skip at top
#  - nrows: limit to N rows
#
# To demonstrate, we'll create an Excel file first.

In [ ]:
# ============================================================
# 4) Writing Excel with formatting via XlsxWriter engine
# ============================================================
#
# Use pd.ExcelWriter(path, engine='xlsxwriter') as writer:
#   df.to_excel(writer, sheet_name='Sheet1', index=False)
#   workbook = writer.book   # xlsxwriter Workbook
#   worksheet = writer.sheets['Sheet1']  # xlsxwriter Worksheet
# Then you can use xlsxwriter APIs to set formats, column widths, create charts, conditional formatting, etc.
#

==========================================================================